recept/src/Documents/СпиасниеВПроизводство/СпиасниеВПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СпиасниеВПроизводство</name>
  <basedOn>Document.Рецептуры</basedOn>
  <registerRecords>AccumulationRegister.СтоимостьМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.ВПроизводстве</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Рецептуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть1</name>
    <attributes>
      <name>НаменованиеМатериала</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМатериала</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.СостояниеОбеспечения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/AccumulationRegisters/ОстаткиМатериалов/ОстаткиМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиМатериалов</name>
  <resources>
    <name>Остаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/AccumulationRegisters/ВПроизводстве/ВПроизводстве.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВПроизводстве</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПроизводства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/AccumulationRegisters/СтоимостьМатериалов/СтоимостьМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтоимостьМатериалов</name>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/Enums/СостояниеОбеспечения/СостояниеОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеОбеспечения</name>
  <enumValues>
    <name>КОбеспечению</name>
  </enumValues>
  <enumValues>
    <name>Отгрузить</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
</mdclass:Enum>

recept/src/Documents/СпиасниеВПроизводство/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Рецептуры") Тогда
		// Заполнение шапки
		ДокументОснование = ДанныеЗаполнения.Ссылка; 
		НомерДокументаОснования = ДанныеЗаполнения.Номер;
		Для Каждого ТекСтрокаРецептураСостав Из ДанныеЗаполнения.РецептураСостав Цикл
			
			ЕдИзм = ТекСтрокаРецептураСостав.ЕдиницаИзмеренияЗагрузки;
			Требуется = ТекСтрокаРецептураСостав.ТребуетсяДляПроизводства;
			ВПроизводстве = ТекСтрокаРецептураСостав.ВПроизводстве;
			Статус = ТекСтрокаРецептураСостав.Действие;
			Нехватка = Требуется - ВПроизводстве; 
			
			//Если НЕ (ЕдИзм = "-" ИЛИ Требуется = 0 ИЛИ Нехватка <= 0) Тогда
			Если НЕ (ЕдИзм = "-" ИЛИ Требуется = 0 ИЛИ Нехватка <= 0) И ТекСтрокаРецептураСостав.Действие = ПредопределенноеЗначение("Перечисление.СостояниеОбеспечения.Отгрузить") Тогда

				НоваяСтрока = ТабличнаяЧасть1.Добавить();
				НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаРецептураСостав.ЕдиницаИзмеренияЗагрузки;
				НоваяСтрока.НаменованиеМатериала = ТекСтрокаРецептураСостав.Материал;
				НоваяСтрока.КоличествоМатериала = Нехватка;
				НоваяСтрока.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(НоваяСтрока.НаменованиеМатериала);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОстаткиМатериалов Расход
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.ВПроизводстве.Записывать = Истина;
	Движения.СтоимостьМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть1 Из ТабличнаяЧасть1 Цикл
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Наименование = ТекСтрокаТабличнаяЧасть1.НаменованиеМатериала;
		Движение.Остаток = ТекСтрокаТабличнаяЧасть1.КоличествоМатериала;        
		
		Движение = Движения.СтоимостьМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Материал = ТекСтрокаТабличнаяЧасть1.НаменованиеМатериала;
		Движение.Стоимость = ТекСтрокаТабличнаяЧасть1.КоличествоМатериала * РаботаСоСправочниками.ЦенаМатериалов(Дата, ТекСтрокаТабличнаяЧасть1.НаменованиеМатериала);

		
		Движение = Движения.ВПроизводстве.Добавить();
		Движение.Период = Дата;
		Движение.Наименование = ТекСтрокаТабличнаяЧасть1.НаменованиеМатериала;
		Движение.НомерПроизводства = ЭтотОбъект.НомерДокументаОснования;
		Движение.Количество = ТекСтрокаТабличнаяЧасть1.КоличествоМатериала;   
	
	КонецЦикла;

	//Контроль остатков
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиМатериаловОстатки.Наименование КАК Наименование,
		|	-ОстаткиМатериаловОстатки.ОстатокОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ОстаткиМатериалов.Остатки(
		|			,
		|			Наименование В
		|				(ВЫБРАТЬ
		|					СпиасниеВПроизводствоТовары.НаменованиеМатериала КАК Номенклатура
		|				ИЗ
		|					Документ.СпиасниеВПроизводство.ТабличнаяЧасть1 КАК СпиасниеВПроизводствоТовары
		|				ГДЕ
		|					СпиасниеВПроизводствоТовары.Ссылка = &Ссылка)) КАК ОстаткиМатериаловОстатки
		|ГДЕ
		|	ОстаткиМатериаловОстатки.ОстатокОстаток < 0";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Отказ = Истина;
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Сообщить("На складе недостаточно " + ВыборкаДетальныеЗаписи.Наименование + " в количестве " + ВыборкаДетальныеЗаписи.Количество);
			
		КонецЦикла;
	КонецЕсли;
				
КонецПроцедуры
